app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`body`, `created_at`, `excerpt`, `location`, `published_at`, `title`, `updated_at`) VALUES ('puts \'Hello, world\'', '2014-09-05 01:52:42', 'Programing ruby ', 'Beijing', '2014-09-05 01:36:00', 'Programing ruby ', '2014-09-05 01:52:42')