app/controllers/comments_controller.rb

INSERT INTO `comments` (`article_id`, `body`, `created_at`, `email`, `name`, `updated_at`) VALUES (1, 'fucking comment ', '2014-09-04 02:17:11', 'comment1', 'comment', '2014-09-04 02:17:11')
---
  def create
    @comment = @article.comments.new(comment_params)

    if @comment.save

SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1 LIMIT 1
---
  def load_article
    @article = Article.find(params[:article_id])