app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `hashed_password`, `updated_at`) VALUES ('2014-09-04 07:16:19', 'chengenbao.zh@ccb.com', '5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8', '2014-09-04 07:16:19')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `hashed_password` = '92375efb60f0b68983c7e99f3a98210d5dc30b47', `updated_at` = '2014-09-04 07:17:34' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)